<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 应用设置
// +----------------------------------------------------------------------

return [
    // +----------------------------------------------------------------------
    // | URL设置
    // +----------------------------------------------------------------------

    // 默认跳转页面对应的模板文件
    'dispatch_error_tmpl' => env('APP_PATH')."index/view/public/error.html",
    'dispatch_success_tmpl' => env('APP_PATH')."index/view/public/success.html",

    // 错误显示信息,非调试模式有效
    'error_message' => '服务器内部错误',
    // 显示错误信息
    'show_error_msg' => false,
    // 异常处理handle类 留空使用 \think\exception\Handle
    'exception_handle' => '',

];
